Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_and_rights/irish_human_rights_commission.html.txt.tmx
Source language: en
Languages: ga

source: Irish Human Rights and Equality Commission
ga: Coimisiún na hÉireann um Chearta an Duine agus Comhionannas

source: The Irish Human Rights and Equality Commission is an independent body set up under the Irish Human Rights and Equality Commission Act 2014 on 1 November 2014
ga: Comhlacht neamhspleách is ea Coimisiún na hÉireann um Chearta an Duine agus Comhionannas a bunaíodh faoin Acht fá Choimisiún na hÉireann um Chearta an Duine agus Comhionannas 2014 an 1 Samhain 2014

source: Under the Act, the Equality Authority and the Irish Human Rights Commission were dissolved and their functions transferred to the Irish Human Rights and Equality Commission
ga: Faoin Acht, díscaoileadh an tÚdarás Comhionannais agus Coimisiún na hÉireann um Chearta an Duine agus aistríodh a bhfeidhmeanna chuig Coimisiún na hÉireann um Chearta an Duine agus Comhionannas

source: The functions of the Commission are to:
ga: Is iad feidhmeanna an Choimisiúin:

source: • Promote and protect human rights and equality
ga: • Cearta an duine agus comhionannas a chur chun cinn agus a chosaint

source: • Encourage the development of a culture of respect for human rights, equality, and intercultural understanding in the State
ga: • Cultúr measa ar chearta an duine, comhionannas, agus tuiscint idirchultúrtha sa Stát a spreagadh agus a fhorbairt

source: • Promote understanding and awareness of the importance of human rights and equality in the State
ga: • Tuiscint agus feasacht ar thábhacht chearta an duine agus chomhionannais sa Stát

source: • Encourage good practice in intercultural relations, to promote tolerance and acceptance of diversity in the State and respect for the freedom and dignity of each person
ga: • Dea-chleachtas a spreagadh i gcaidreamh idirchultúrtha, chun caoinfhulaingt agus glacadh le héagsúlacht a chur chun cinn sa Stát mar aon le meas ar shaoirse agus dínit gach duine

source: • Work towards the elimination of human rights abuses, discrimination and prohibited conduct
ga: • Oibriú i dtreo mí-úsáid a bhaint as cearta an duine, idirdhealú agus iompar toirmiscthe a dhíbirt

source: The Commission carries out these functions by:
ga: Tugann an Coimisiún faoi na feidhmeanna seo tríd an méid a leanas a dhéanamh:

source: • Providing information to the public in relation to human rights and equality generally
ga: • Faisnéis a sholáthar don phobal maidir le cearta an duine agus comhionannas go ginearálta

source: • Keeping under review the adequacy and effectiveness of law and practice in the State relating to human rights and equality
ga: • Leordhóthanacht agus éifeacht an dlí agus an chleachtais sa Stát a choimeád faoi athbhreithniú maidir le cearta an duine agus comhionannas

source: • Making recommendations to Government on measures to strengthen, protect and uphold human rights and equality in the State
ga: • Moltaí a dhéanamh don Rialtas ar bhearta chun cearta an duine agus comhionannas a threisiú, a chosaint agus chun seasamh leo sa Stát

source: • Examining any legislative proposal and report its views on any implications for human rights or equality
ga: • Aon togra reachtaíochta a scrúdú agus tuairisciú a dhéanamh ar a dhearcthaí ar chearta an duine agus comhionannas

source: • Providing legal assistance to people taking legal proceeding to vindicate their rights (this is subject to certain conditions)
ga: • Cúnamh dlí a sholáthar do dhaoine a ghlacann imeachtaí dlí chun a gcearta a fheidhmiú (tá seo faoi réir roinnt coinníollacha)

source: • Taking legal proceedings to vindicate human rights in the State
ga: • Imeachtaí dlí a ghlacadh chun cearta an duine a fheidhmiú sa Stát

source: • Consulting with relevant national and international bodies around human rights or equality issues
ga: • Comhairliúchán a dhéanamh le comhlachtaí náisiúnta agus idirnáisiúnta maidir le saincheisteanna chearta an duine agus comhionannais

source: • Providing or assisting in the provision of education and training on human rights and equality issues
ga: • Oideachas agus oiliúint a sholáthar nó cabhrú lena soláthar ar shaincheisteanna chearta an duine agus comhionannais

source: • Carrying out equality reviews and preparing equality action plans
ga: • Tabhairt faoi athbhreithnithe ar chomhionannas agus pleananna gníomhaíochta comhionannais a réiteach

source: • Conducting inquiries into possible violation of human rights or equality of treatment obligations in the State
ga: • Fiosrúcháin a dhéanamh ar shárú féideartha dhualgais chearta an duine agus um chóir chomhionann sa Stát

source: • Participating in the Joint Committee of Representatives of members of the Commission and members of the Northern Ireland Human Rights Commission
ga: • Páirt a ghlacadh i gComhchoiste Ionadaithe chomhaltaí an Choimisiúin agus chomhaltaí Choimisiún um Chearta an Duine Thuaisceart Éireann

source: The Commission can assist you to further human rights issues by assisting you with legal proceedings
ga: Féadfaidh an Coimisiún cabhrú leat chun saincheisteanna chearta an duine a chur chun cinn trí chabhrú leat le do chuid imeachtaí dlí

source: If you want the Commission to grant assistance in relation to legal proceedings involving issues of human rights you must first be clear what the human right issue is
ga: Más mian leat go dtabharfaidh an Coimisiún cúnamh a dheonú maidir le himeachtaí dlí ina bhfuil baint ag saincheisteanna chearta an duine, ní mór duit a bheith soiléir faoi cén ceart an duine atá i gceist

source: When you make your request to the Commission:
ga: Nuair a dhéanann tú d’iarratas ar an gCoimisiún:

source: • Be clear how the legal proceeding is linked to the function of the Commission
ga: • Bí soiléir faoi conas atá an t-imeacht dlí nasctha le feidhm an Choimisiúin

source: • Identify how the legal proceeding could change how human rights are protected in Ireland
ga: • Sainaithin conas a d’fhéadfadh an t-imeacht dlíthiúil an bealach a chosnaítear cearta an duine in Éirinn a athrú

source: • You must have made reasonable efforts to get legal assistance elsewhere, for example, civil legal aid or criminal legal aid
ga: • Níor mhór go ndearna tú iarrachtaí réasúnta chun cúnamh dlíthiúil a fháil in áit eile, mar shampla, cúnamh dlí sibhialta nó cúnamh dlí coiriúil

source: The Commission is not an adjudicator body in respect of complaints of human rights violations in Ireland
ga: Ní comhlacht moltóirí an Coimisiún maidir le gearáin i leith sáruithe ar chearta an duine in Éirinn

source: It cannot offer remedies or compensation in cases where human rights have been violated
ga: Ní féidir leo réitigh nó cúiteamh a chur ar tairiscint i gcásanna inar sáraíodh cearta an duine

source: It cannot overturn court, or tribunal decisions, or require government departments to give entitlements to people who may feel they have an entitlement
ga: Ní féidir leo cinntí cúirte, nó binse a chur ar ceal, nó iarraidh ar ranna rialtais chun teidlíochtaí a thabhairt do dhaoine a d’fhéadfadh braistint go bhfuil teidlíocht acu

source: Contact the Commission for more information about how requests for legal assistance are assessed
ga: Déan teagmháil leis an gCoimisiún chun teacht ar bhreis faisnéise faoi conas a mheasúnaítear iarratais ar chúnamh dlí

source: There are 2 distinct pieces of legislation in place which set out equality rights for people and specifically outlaw discrimination when it occurs
ga: Tá dhá phíosa reachtaíochta ar leith i bhfeidhm ina leagtar amach cearta comhionannais do dhaoine agus a eisreachtaíonn idirdhealú nuair a tharlaíonn sé

source: The Employment Equality Acts 1998–2015 and the Equal Status Acts 2000–2015 outlaw discrimination in employment, vocational training, advertising, collective agreements, the provision of goods and services
ga: Eisreachtaíonn na hAchtanna um Chomhionannas Fostaíochta, 1998-2015 agus na hAchtanna um Stádas Comhionann 2000-2015 idirdhealú i bhfostaíocht, gairmoiliúint, fógraíocht, comhaontuithe comhchoiteanna, soláthar earraí agus seirbhísí

source: Specifically, goods and services include professional or trade services; health services; access to accommodation and education; facilities for banking, transport and cultural activities
ga: Go sonrach, áirítear le hearraí agus seirbhísí – seirbhísí gairmiúla nó trádála; seirbhísí sláinte; rochtain ar chóiríocht agus oideachas; áiseanna le haghaidh baincéireachta, iompair agus gníomhaíochtaí cultúrtha

source: Under equality legislation discrimination based on any one of the following distinct grounds is unlawful. These grounds are:
ga: Faoin reachtaíocht chomhionannais, tá idirdhealú neamhdhleathach má tá sé bunaithe ar aon cheann de na forais seo a leanas:

source: • Age (does not apply to a person under 16)
ga: • Aois (ní bhaineann seo le duine faoi bhun 16 bliana)

source: • Membership of the Traveller community
ga: • Ballraíocht den Lucht Siúil

source: Since 1 January 2016, under the Equal Status Acts 2000–2015, you cannot be discriminated against when renting because you are getting Rent Supplement or any other social welfare payment, or a Housing Assistance Payment
ga: Ó 1 Eanáir 2016, faoi na hAchtanna um Stádas Comhionann 2000-2015, is féidir aon duine a idirdhealú in aghaidh leat nuair a bhíonn tú ar cíos mar go bhfuil tú ag fáil Forlíonadh Cíosa nó aon íocaíocht leasa shóisialaigh eile, nó Íocaíocht um Chúnamh Tithíochta

source: This is known as the housing assistance ground
ga: Tá sé seo ar a dtugtar an talamh cúnaimh tithíochta

source: Discrimination is defined as less favourable treatment
ga: Is é an sainmhíniú a thugtar ar idirdhealú ná cóir is lú fabhar

source: A person is said to be discriminated against if they are treated less favourably than another is, has been or would be treated in a comparable situation on any of the grounds mentioned above
ga: Deirtear go ndearnadh idirdhealú i leith duine mura gcaitear chomh fabhrach céanna leis nó léi agus a chaitear le duine eile, agus a caitheadh le duine eile nó agus a chaithfí le duine eile ina mhacasamhail de chás ar aon cheann de na forais atá luaite thuas

source: To establish direct discrimination, a direct comparison must be made, for example, in the case of disability discrimination the comparison must be between a person who has a disability and another who has not, or between persons with different disabilities
ga: Chun idirdhealú a dheimhniú, ní mór comparáid dhíreach a dhéanamh, mar shampla, i gcás idirdhealú míchumais, ní mór go bhfuil an chomparáid idir duine atá faoi mhíchumas agus duine eile nach bhfuil, nó idir daoine atá faoi mhíchumais éagsúla

source: Indirect discrimination occurs when practices or policies that do not appear to discriminate against one group more than another actually have a discriminatory impact
ga: Tarlaíonn idirdhealú indíreach nuair a tharlaíonn sé go n-imríonn cleachtais nó beartais tionchar idirdhealaitheach, nach dealraitheach a dhéanann idirdhealú níos mó i leith grúpa amháin ná mar a imríonn siad ar ghrúpa eile

source: It can also happen where a requirement that may appear non-discriminatory
ga: Féadfaidh sé tarlú, chomh maith, nuair a imríonn riachtanas tionchar idirdhealaitheach a bhfuil an chuma air nach amhlaidh atá á dhéanamh aige

source: Complaints under the Employment Equality Acts 1998-2015 must be brought within 6 months of the last act of discrimination
ga: Ní mór gearáin faoi na hAchtanna um Chomhionannas Fostaíochta, 1998-2015 a dhéanamh laistigh de 6 mhí ó tharla an gníomh deiridh idirdhealaithe

source: You can make a complaint to the Workplace Relations Commission using the online complaint form on workplacerelations.ie
ga: Féadfaidh tú gearán a dhéanamh chuig an gCoimisiúin um Chaidreamh san Áit Oibre trí leas a bhaint as an bhfoirm ghearáin ar líne atá ar fáil ar workplacerelations.ie

source: To make a complaint under the Equal Status Acts 2000-2015 you must first notify the person or organisation you are making the complaint against within 2 months of the last act of discrimination
ga: Chun gearán a dhéanamh faoi na hAchtanna um Stádas Comhionann, 2000-2015, ní mór duit an duine nó an eagraíocht a chur ar an eolas a bhfuil an gearán á dhéanamh agat fúthu laistigh de 2 mhí tar éis go ndearnadh an gníomh deiridh idirdhealaithe

source: If you are not satisfied with the service provider's response, or if they have made no response within 1 month from the date you notified them, you can bring a complaint to the Workplace Relations Commission within 6 months of the last act of discrimination
ga: Mura bhfuil tú sásta le freagairt sholáthróir na seirbhíse, nó murar thug siad aon fhreagairt laistigh de mhí amháin ón dáta a chuir tú ar an eolas iad, féadfaidh tú gearán a chur faoi bhráid an Choimisiúin um Chaidreamh san Áit Oibre laistigh de 6 mhí tar éis an ghnímh deiridh idirdhealaithe

source: You can read more information in our document, Disputes about equality and discrimination
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméad, Díospóidí faoi chomhionannas agus idirdhealú
